<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads EMC Syncplicity disk image and builds a package.</string>
    <key>Identifier</key>
    <string>local.pkg.EMCSyncplicity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EMCSyncplicity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.kernsb.download.EMCSyncplicity</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/Syncplicity-*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PkgPayloadUnpacker</string>
        	<key>Arguments</key>
        	<dict>
        		<key>pkg_payload_path</key>
        		<string>%RECIPE_CACHE_DIR%/unpack/Syncplicity.Component.pkg/Payload</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/payload/</string>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        </dict>
    </array>
</dict>
</plist>