<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads EMC Syncplicity disk image and builds a package.</string>
    <key>Identifier</key>
    <string>local.pkg.EMCSyncplicity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EMCSyncplicity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.kernsb.download.EMCSyncplicity</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Syncplicity-*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/package</string>
                <key>overwrite</key>
                </false>
            </dict>
        </dict>
    </array>
</dict>
</plist>