<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Zoom and builds a package.</string>
	<key>Identifier</key>
	<string>cache22.pkg.Zoom</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>us.zoom.xos</string>
		<key>NAME</key>
		<string>Zoom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.zoomus</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        <dict>
        	<key>Processor</key>
        	<string>PkgPayloadUnpacker</string>
        	<key>Arguments</key>
        	<dict>
        		<key>pkg_payload_path</key>
        		<string>%RECIPE_CACHE_DIR%/unpack/zoomus.pkg/Payload</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/unpack/payload/</string>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/payload/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/%NAME%.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>