<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads a Java 8 JDK from Eclipse Temurin and builds a package, then uploads to the JSS.</string>
	<key>Identifier</key>
	<string>nz.ac.otago.jss.EclipseTemurin8</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x64</string>
		<key>FEATURE_VERSION</key>
		<string>8</string>
		<key>HEAP_SIZE</key>
		<string>normal</string>
		<key>IMAGE_TYPE</key>
		<string>jdk</string>
		<key>JVM_IMPLEMENTATION</key>
		<string>hotspot</string>
		<key>NAME</key>
		<string>Eclipse Temurin 8</string>
		<key>OS</key>
		<string>mac</string>
		<key>RELEASE_TYPE</key>
		<string>ga</string>
		<key>VENDOR</key>
		<string>adoptium</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>AutoPkg: %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Adoptium OpenJDK Java Development Kit using the Hotspot JVM, version 8. 64-bit only.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>adoptium.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.pkg.EclipseTemurin-8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>